Revit 2020 API
BumpMap Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class BumpMap
Visual Basic
Public NotInheritable Class BumpMap
Visual C++
public ref class BumpMap abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.BumpMap
See Also
BumpMap Members
Autodesk.Revit.DB.Visual Namespace